---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.GraphicsStyleId
source: html/b52fe304-95a0-77c8-4b4c-e3c18c16677d.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.GraphicsStyleId Property

Optional - if set, the built geometry will use that graphics style.

## Syntax (C#)
```csharp
public ElementId GraphicsStyleId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null